; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-6-10)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	p0-1 - location
	p0-5 - location
	p0-7 - location
	p1-4 - location
	p1-5 - location
	p1-6 - location
	p1-8 - location
	p3-0 - location
	p3-8 - location
	p5-0 - location
	p5-2 - location
	p5-4 - location
	p5-9 - location
	p6-0 - location
	p6-3 - location
	p7-10 - location
	p8-2 - location
	p10-7 - location
	p10-9 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s0)
	(at driver3 s9)
	(at driver4 s2)
	(at truck1 s7)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s9)
	(empty truck4)
	(at truck5 s5)
	(empty truck5)
	(at truck6 s0)
	(empty truck6)
	(at package1 s9)
	(at package2 s9)
	(at package3 s3)
	(at package4 s0)
	(at package5 s2)
	(at package6 s1)
	(at package7 s7)
	(at package8 s4)
	(at package9 s0)
	(at package10 s10)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 42)
	(= (time-to-walk p0-1 s0) 42)
	(= (time-to-walk s1 p0-1) 90)
	(= (time-to-walk p0-1 s1) 90)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(= (time-to-walk s0 p0-5) 78)
	(= (time-to-walk p0-5 s0) 78)
	(= (time-to-walk s5 p0-5) 7)
	(= (time-to-walk p0-5 s5) 7)
	(path s0 p0-7)
	(path p0-7 s0)
	(path s7 p0-7)
	(path p0-7 s7)
	(= (time-to-walk s0 p0-7) 73)
	(= (time-to-walk p0-7 s0) 73)
	(= (time-to-walk s7 p0-7) 31)
	(= (time-to-walk p0-7 s7) 31)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 42)
	(= (time-to-walk p1-4 s1) 42)
	(= (time-to-walk s4 p1-4) 1)
	(= (time-to-walk p1-4 s4) 1)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(= (time-to-walk s1 p1-5) 74)
	(= (time-to-walk p1-5 s1) 74)
	(= (time-to-walk s5 p1-5) 26)
	(= (time-to-walk p1-5 s5) 26)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(= (time-to-walk s1 p1-6) 6)
	(= (time-to-walk p1-6 s1) 6)
	(= (time-to-walk s6 p1-6) 39)
	(= (time-to-walk p1-6 s6) 39)
	(path s1 p1-8)
	(path p1-8 s1)
	(path s8 p1-8)
	(path p1-8 s8)
	(= (time-to-walk s1 p1-8) 75)
	(= (time-to-walk p1-8 s1) 75)
	(= (time-to-walk s8 p1-8) 30)
	(= (time-to-walk p1-8 s8) 30)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 69)
	(= (time-to-walk p3-0 s3) 69)
	(= (time-to-walk s0 p3-0) 60)
	(= (time-to-walk p3-0 s0) 60)
	(path s3 p3-8)
	(path p3-8 s3)
	(path s8 p3-8)
	(path p3-8 s8)
	(= (time-to-walk s3 p3-8) 46)
	(= (time-to-walk p3-8 s3) 46)
	(= (time-to-walk s8 p3-8) 10)
	(= (time-to-walk p3-8 s8) 10)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(= (time-to-walk s5 p5-2) 52)
	(= (time-to-walk p5-2 s5) 52)
	(= (time-to-walk s2 p5-2) 11)
	(= (time-to-walk p5-2 s2) 11)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(= (time-to-walk s5 p5-4) 64)
	(= (time-to-walk p5-4 s5) 64)
	(= (time-to-walk s4 p5-4) 9)
	(= (time-to-walk p5-4 s4) 9)
	(path s5 p5-9)
	(path p5-9 s5)
	(path s9 p5-9)
	(path p5-9 s9)
	(= (time-to-walk s5 p5-9) 53)
	(= (time-to-walk p5-9 s5) 53)
	(= (time-to-walk s9 p5-9) 6)
	(= (time-to-walk p5-9 s9) 6)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(= (time-to-walk s6 p6-0) 21)
	(= (time-to-walk p6-0 s6) 21)
	(= (time-to-walk s0 p6-0) 58)
	(= (time-to-walk p6-0 s0) 58)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(= (time-to-walk s6 p6-3) 1)
	(= (time-to-walk p6-3 s6) 1)
	(= (time-to-walk s3 p6-3) 47)
	(= (time-to-walk p6-3 s3) 47)
	(path s7 p7-10)
	(path p7-10 s7)
	(path s10 p7-10)
	(path p7-10 s10)
	(= (time-to-walk s7 p7-10) 55)
	(= (time-to-walk p7-10 s7) 55)
	(= (time-to-walk s10 p7-10) 2)
	(= (time-to-walk p7-10 s10) 2)
	(path s8 p8-2)
	(path p8-2 s8)
	(path s2 p8-2)
	(path p8-2 s2)
	(= (time-to-walk s8 p8-2) 80)
	(= (time-to-walk p8-2 s8) 80)
	(= (time-to-walk s2 p8-2) 96)
	(= (time-to-walk p8-2 s2) 96)
	(path s10 p10-9)
	(path p10-9 s10)
	(path s9 p10-9)
	(path p10-9 s9)
	(= (time-to-walk s10 p10-9) 91)
	(= (time-to-walk p10-9 s10) 91)
	(= (time-to-walk s9 p10-9) 58)
	(= (time-to-walk p10-9 s9) 58)
	(link s0 s9)
	(link s9 s0)
	(= (time-to-drive s0 s9) 3)
	(= (time-to-drive s9 s0) 3)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 64)
	(= (time-to-drive s3 s1) 64)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 88)
	(= (time-to-drive s1 s2) 88)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 45)
	(= (time-to-drive s2 s3) 45)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 65)
	(= (time-to-drive s4 s3) 65)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 62)
	(= (time-to-drive s7 s3) 62)
	(link s3 s10)
	(link s10 s3)
	(= (time-to-drive s3 s10) 71)
	(= (time-to-drive s10 s3) 71)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 70)
	(= (time-to-drive s2 s4) 70)
	(link s4 s7)
	(link s7 s4)
	(= (time-to-drive s4 s7) 1)
	(= (time-to-drive s7 s4) 1)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 45)
	(= (time-to-drive s3 s5) 45)
	(link s5 s10)
	(link s10 s5)
	(= (time-to-drive s5 s10) 99)
	(= (time-to-drive s10 s5) 99)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 69)
	(= (time-to-drive s2 s6) 69)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 4)
	(= (time-to-drive s3 s6) 4)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 45)
	(= (time-to-drive s5 s6) 45)
	(link s6 s7)
	(link s7 s6)
	(= (time-to-drive s6 s7) 78)
	(= (time-to-drive s7 s6) 78)
	(link s6 s8)
	(link s8 s6)
	(= (time-to-drive s6 s8) 55)
	(= (time-to-drive s8 s6) 55)
	(link s6 s9)
	(link s9 s6)
	(= (time-to-drive s6 s9) 55)
	(= (time-to-drive s9 s6) 55)
	(link s7 s1)
	(link s1 s7)
	(= (time-to-drive s7 s1) 42)
	(= (time-to-drive s1 s7) 42)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 63)
	(= (time-to-drive s5 s7) 63)
	(link s8 s2)
	(link s2 s8)
	(= (time-to-drive s8 s2) 8)
	(= (time-to-drive s2 s8) 8)
	(link s8 s4)
	(link s4 s8)
	(= (time-to-drive s8 s4) 48)
	(= (time-to-drive s4 s8) 48)
	(link s8 s5)
	(link s5 s8)
	(= (time-to-drive s8 s5) 84)
	(= (time-to-drive s5 s8) 84)
	(link s8 s7)
	(link s7 s8)
	(= (time-to-drive s8 s7) 65)
	(= (time-to-drive s7 s8) 65)
	(link s8 s9)
	(link s9 s8)
	(= (time-to-drive s8 s9) 48)
	(= (time-to-drive s9 s8) 48)
	(link s9 s7)
	(link s7 s9)
	(= (time-to-drive s9 s7) 30)
	(= (time-to-drive s7 s9) 30)
	(link s10 s0)
	(link s0 s10)
	(= (time-to-drive s10 s0) 19)
	(= (time-to-drive s0 s10) 19)
	(link s10 s4)
	(link s4 s10)
	(= (time-to-drive s10 s4) 49)
	(= (time-to-drive s4 s10) 49)
	(link s10 s7)
	(link s7 s10)
	(= (time-to-drive s10 s7) 9)
	(= (time-to-drive s7 s10) 9)
	(link s10 s9)
	(link s9 s10)
	(= (time-to-drive s10 s9) 15)
	(= (time-to-drive s9 s10) 15)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s2)
	(at driver2 s7)
	(at driver3 s5)
	(at truck1 s4)
	(at truck2 s0)
	(at truck3 s7)
	(at truck4 s6)
	(at truck5 s1)
	(at truck6 s0)
	(at package1 s4)
	(at package2 s5)
	(at package3 s4)
	(at package4 s7)
	(at package5 s3)
	(at package6 s4)
	(at package7 s6)
	(at package8 s4)
	(at package9 s10)
	(at package10 s0)
	))

(:metric minimize (+ (+ (* 2  (total-time)) (* 3  (driven))) (* 1  (walked))))

)

; plan
1. (walk driver2 s0 p0-1)
   deleted: (at driver2 s0)
   added: (at driver2 p0-1)
   changed: (walked) from 0 to 42
   goals met: 2 of 19
2. (board-truck driver3 truck4 s9)
   deleted: (at driver3 s9) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 2 of 19
3. (walk driver2 p0-1 s1)
   deleted: (at driver2 p0-1)
   added: (at driver2 s1)
   changed: (walked) from 42 to 132
   goals met: 2 of 19
4. (load-truck package1 truck4 s9)
   deleted: (at package1 s9)
   added: (in package1 truck4)
   goals met: 2 of 19
5. (walk driver1 s4 p5-4)
   deleted: (at driver1 s4)
   added: (at driver1 p5-4)
   changed: (walked) from 132 to 141
   goals met: 2 of 19
6. (board-truck driver2 truck2 s1)
   deleted: (at driver2 s1) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 2 of 19
7. (load-truck package2 truck4 s9)
   deleted: (at package2 s9)
   added: (in package2 truck4)
   goals met: 2 of 19
8. (drive-truck truck4 s9 s6 driver3)
   deleted: (at truck4 s9)
   added: (at truck4 s6)
   changed: (driven) from 0 to 55
   goals met: 3 of 19
9. (walk driver1 p5-4 s5)
   deleted: (at driver1 p5-4)
   added: (at driver1 s5)
   changed: (walked) from 141 to 205
   goals met: 3 of 19
10. (drive-truck truck2 s1 s3 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   changed: (driven) from 55 to 119
   goals met: 3 of 19
11. (load-truck package3 truck2 s3)
   deleted: (at package3 s3)
   added: (in package3 truck2)
   goals met: 3 of 19
12. (drive-truck truck2 s3 s10 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s10)
   changed: (driven) from 119 to 190
   goals met: 3 of 19
13. (load-truck package10 truck2 s10)
   deleted: (at package10 s10)
   added: (in package10 truck2)
   goals met: 3 of 19
14. (drive-truck truck2 s10 s4 driver2)
   deleted: (at truck2 s10)
   added: (at truck2 s4)
   changed: (driven) from 190 to 239
   goals met: 3 of 19
15. (unload-truck package3 truck2 s4)
   deleted: (in package3 truck2)
   added: (at package3 s4)
   goals met: 4 of 19
16. (drive-truck truck2 s4 s10 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s10)
   changed: (driven) from 239 to 288
   goals met: 4 of 19
17. (drive-truck truck4 s6 s3 driver3)
   deleted: (at truck4 s6)
   added: (at truck4 s3)
   changed: (driven) from 288 to 292
   goals met: 3 of 19
18. (drive-truck truck4 s3 s1 driver3)
   deleted: (at truck4 s3)
   added: (at truck4 s1)
   changed: (driven) from 292 to 356
   goals met: 3 of 19
19. (load-truck package6 truck4 s1)
   deleted: (at package6 s1)
   added: (in package6 truck4)
   goals met: 3 of 19
20. (drive-truck truck4 s1 s3 driver3)
   deleted: (at truck4 s1)
   added: (at truck4 s3)
   changed: (driven) from 356 to 420
   goals met: 3 of 19
21. (board-truck driver1 truck5 s5)
   deleted: (at driver1 s5) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 3 of 19
22. (drive-truck truck5 s5 s3 driver1)
   deleted: (at truck5 s5)
   added: (at truck5 s3)
   changed: (driven) from 420 to 465
   goals met: 3 of 19
23. (drive-truck truck5 s3 s2 driver1)
   deleted: (at truck5 s3)
   added: (at truck5 s2)
   changed: (driven) from 465 to 510
   goals met: 3 of 19
24. (load-truck package5 truck5 s2)
   deleted: (at package5 s2)
   added: (in package5 truck5)
   goals met: 3 of 19
25. (drive-truck truck4 s3 s7 driver3)
   deleted: (at truck4 s3)
   added: (at truck4 s7)
   changed: (driven) from 510 to 572
   goals met: 3 of 19
26. (load-truck package7 truck4 s7)
   deleted: (at package7 s7)
   added: (in package7 truck4)
   goals met: 3 of 19
27. (drive-truck truck4 s7 s5 driver3)
   deleted: (at truck4 s7)
   added: (at truck4 s5)
   changed: (driven) from 572 to 635
   goals met: 3 of 19
28. (unload-truck package2 truck4 s5)
   deleted: (in package2 truck4)
   added: (at package2 s5)
   goals met: 4 of 19
29. (drive-truck truck4 s5 s6 driver3)
   deleted: (at truck4 s5)
   added: (at truck4 s6)
   changed: (driven) from 635 to 680
   goals met: 5 of 19
30. (unload-truck package7 truck4 s6)
   deleted: (in package7 truck4)
   added: (at package7 s6)
   goals met: 6 of 19
31. (drive-truck truck4 s6 s7 driver3)
   deleted: (at truck4 s6)
   added: (at truck4 s7)
   changed: (driven) from 680 to 758
   goals met: 5 of 19
32. (drive-truck truck5 s2 s3 driver1)
   deleted: (at truck5 s2)
   added: (at truck5 s3)
   changed: (driven) from 758 to 803
   goals met: 5 of 19
33. (unload-truck package5 truck5 s3)
   deleted: (in package5 truck5)
   added: (at package5 s3)
   goals met: 6 of 19
34. (drive-truck truck5 s3 s1 driver1)
   deleted: (at truck5 s3)
   added: (at truck5 s1)
   changed: (driven) from 803 to 867
   goals met: 7 of 19
35. (disembark-truck driver1 truck5 s1)
   deleted: (driving driver1 truck5)
   added: (at driver1 s1) (empty truck5)
   goals met: 7 of 19
36. (board-truck driver1 truck3 s1)
   deleted: (at driver1 s1) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 7 of 19
37. (drive-truck truck3 s1 s2 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (driven) from 867 to 955
   goals met: 7 of 19
38. (disembark-truck driver1 truck3 s2)
   deleted: (driving driver1 truck3)
   added: (at driver1 s2) (empty truck3)
   goals met: 8 of 19
39. (board-truck driver4 truck3 s2)
   deleted: (at driver4 s2) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 8 of 19
40. (drive-truck truck3 s2 s8 driver4)
   deleted: (at truck3 s2)
   added: (at truck3 s8)
   changed: (driven) from 955 to 963
   goals met: 8 of 19
41. (drive-truck truck3 s8 s7 driver4)
   deleted: (at truck3 s8)
   added: (at truck3 s7)
   changed: (driven) from 963 to 1028
   goals met: 9 of 19
42. (drive-truck truck4 s7 s4 driver3)
   deleted: (at truck4 s7)
   added: (at truck4 s4)
   changed: (driven) from 1028 to 1029
   goals met: 9 of 19
43. (unload-truck package1 truck4 s4)
   deleted: (in package1 truck4)
   added: (at package1 s4)
   goals met: 10 of 19
44. (drive-truck truck4 s4 s8 driver3)
   deleted: (at truck4 s4)
   added: (at truck4 s8)
   changed: (driven) from 1029 to 1077
   goals met: 10 of 19
45. (disembark-truck driver4 truck3 s7)
   deleted: (driving driver4 truck3)
   added: (at driver4 s7) (empty truck3)
   goals met: 10 of 19
46. (board-truck driver4 truck1 s7)
   deleted: (at driver4 s7) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 10 of 19
47. (drive-truck truck1 s7 s4 driver4)
   deleted: (at truck1 s7)
   added: (at truck1 s4)
   changed: (driven) from 1077 to 1078
   goals met: 11 of 19
48. (drive-truck truck2 s10 s0 driver2)
   deleted: (at truck2 s10)
   added: (at truck2 s0)
   changed: (driven) from 1078 to 1097
   goals met: 12 of 19
49. (unload-truck package10 truck2 s0)
   deleted: (in package10 truck2)
   added: (at package10 s0)
   goals met: 13 of 19
50. (drive-truck truck4 s8 s6 driver3)
   deleted: (at truck4 s8)
   added: (at truck4 s6)
   changed: (driven) from 1097 to 1152
   goals met: 14 of 19
51. (load-truck package4 truck2 s0)
   deleted: (at package4 s0)
   added: (in package4 truck2)
   goals met: 14 of 19
52. (load-truck package9 truck2 s0)
   deleted: (at package9 s0)
   added: (in package9 truck2)
   goals met: 14 of 19
53. (drive-truck truck2 s0 s10 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s10)
   changed: (driven) from 1152 to 1171
   goals met: 13 of 19
54. (unload-truck package9 truck2 s10)
   deleted: (in package9 truck2)
   added: (at package9 s10)
   goals met: 14 of 19
55. (drive-truck truck2 s10 s7 driver2)
   deleted: (at truck2 s10)
   added: (at truck2 s7)
   changed: (driven) from 1171 to 1180
   goals met: 14 of 19
56. (unload-truck package4 truck2 s7)
   deleted: (in package4 truck2)
   added: (at package4 s7)
   goals met: 15 of 19
57. (drive-truck truck4 s6 s7 driver3)
   deleted: (at truck4 s6)
   added: (at truck4 s7)
   changed: (driven) from 1180 to 1258
   goals met: 14 of 19
58. (drive-truck truck2 s7 s9 driver2)
   deleted: (at truck2 s7)
   added: (at truck2 s9)
   changed: (driven) from 1258 to 1288
   goals met: 14 of 19
59. (drive-truck truck2 s9 s0 driver2)
   deleted: (at truck2 s9)
   added: (at truck2 s0)
   changed: (driven) from 1288 to 1291
   goals met: 15 of 19
60. (disembark-truck driver2 truck2 s0)
   deleted: (driving driver2 truck2)
   added: (at driver2 s0) (empty truck2)
   goals met: 15 of 19
61. (walk driver2 s0 p0-7)
   deleted: (at driver2 s0)
   added: (at driver2 p0-7)
   changed: (walked) from 205 to 278
   goals met: 15 of 19
62. (walk driver2 p0-7 s7)
   deleted: (at driver2 p0-7)
   added: (at driver2 s7)
   changed: (walked) from 278 to 309
   goals met: 16 of 19
63. (drive-truck truck4 s7 s5 driver3)
   deleted: (at truck4 s7)
   added: (at truck4 s5)
   changed: (driven) from 1291 to 1354
   goals met: 16 of 19
64. (disembark-truck driver3 truck4 s5)
   deleted: (driving driver3 truck4)
   added: (at driver3 s5) (empty truck4)
   goals met: 17 of 19
65. (drive-truck truck1 s4 s3 driver4)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   changed: (driven) from 1354 to 1419
   goals met: 16 of 19
66. (board-truck driver3 truck4 s5)
   deleted: (at driver3 s5) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 15 of 19
67. (drive-truck truck4 s5 s6 driver3)
   deleted: (at truck4 s5)
   added: (at truck4 s6)
   changed: (driven) from 1419 to 1464
   goals met: 16 of 19
68. (drive-truck truck1 s3 s6 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s6)
   changed: (driven) from 1464 to 1468
   goals met: 16 of 19
69. (drive-truck truck4 s6 s2 driver3)
   deleted: (at truck4 s6)
   added: (at truck4 s2)
   changed: (driven) from 1468 to 1537
   goals met: 15 of 19
70. (drive-truck truck4 s2 s4 driver3)
   deleted: (at truck4 s2)
   added: (at truck4 s4)
   changed: (driven) from 1537 to 1607
   goals met: 15 of 19
71. (unload-truck package6 truck4 s4)
   deleted: (in package6 truck4)
   added: (at package6 s4)
   goals met: 16 of 19
72. (drive-truck truck1 s6 s7 driver4)
   deleted: (at truck1 s6)
   added: (at truck1 s7)
   changed: (driven) from 1607 to 1685
   goals met: 16 of 19
73. (disembark-truck driver3 truck4 s4)
   deleted: (driving driver3 truck4)
   added: (at driver3 s4) (empty truck4)
   goals met: 16 of 19
74. (drive-truck truck1 s7 s4 driver4)
   deleted: (at truck1 s7)
   added: (at truck1 s4)
   changed: (driven) from 1685 to 1686
   goals met: 17 of 19
75. (disembark-truck driver4 truck1 s4)
   deleted: (driving driver4 truck1)
   added: (at driver4 s4) (empty truck1)
   goals met: 17 of 19
76. (walk driver3 s4 p5-4)
   deleted: (at driver3 s4)
   added: (at driver3 p5-4)
   changed: (walked) from 309 to 318
   goals met: 17 of 19
77. (walk driver3 p5-4 s5)
   deleted: (at driver3 p5-4)
   added: (at driver3 s5)
   changed: (walked) from 318 to 382
   goals met: 18 of 19
78. (board-truck driver4 truck4 s4)
   deleted: (at driver4 s4) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 18 of 19
79. (drive-truck truck4 s4 s8 driver4)
   deleted: (at truck4 s4)
   added: (at truck4 s8)
   changed: (driven) from 1686 to 1734
   goals met: 18 of 19
80. (drive-truck truck4 s8 s6 driver4)
   deleted: (at truck4 s8)
   added: (at truck4 s6)
   changed: (driven) from 1734 to 1789
   goals met: 19 of 19
